import Wrapper from "./reusable/Wrapper";
import Long from "./reusable/Long";
import { useNavigate } from "react-router-dom";

function Parents() {
  const navigate = useNavigate();

  return (
    <Wrapper height="470px">
      <div className="Parents">
        <div className="shape">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="384"
            height="295"
            viewBox="0 0 384 295"
            fill="none"
            className="big"
          >
            <path
              d="M34.7722 81.6821C31.6345 101.216 34.7722 133.234 34.7722 137.92C34.7722 155.1 21.0631 161.416 12.9701 173.05C1.71831 189.224 -1.88398 200.757 6.93459 221.53C23.2355 259.927 63.2898 276.134 89.0913 264.333C121.021 246.705 148.732 271.806 167.988 281.958C193.884 297.577 226.324 296.899 256.665 278.181C277.498 265.329 280.435 235.378 310.784 235.378C332.227 235.378 355.786 232.502 368.163 213.976C392.471 177.59 382.508 108.226 355.69 84.3069C339.254 69.6465 313.022 67.941 302.589 43.3919C294.201 23.6531 279.379 9.04308 259.555 4.99473C225.649 -1.9293 209.868 3.60954 184.736 16.9104C168.177 25.6742 153.79 41.2669 134.532 30.9718C110.875 20.7793 89.627 18.4365 69.8287 27.027C52.4428 35.6171 38.1143 60.8766 34.7722 81.6821Z"
              fill="#FFD200"
              stroke="black"
              strokeWidth="4"
              strokeLinecap="round"
            />
          </svg>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="280"
            height="196"
            viewBox="0 0 280 196"
            fill="none"
            className="small"
          >
            <path
              d="M28.3628 51.5027C26 64.0092 28.3628 84.5092 28.3628 87.5092C28.3628 98.5092 18.0397 102.553 11.9456 110.001C1.16866 121.509 0.838444 140.009 3.16911 152.509C8.66928 182.009 52.197 181.352 71.6257 173.796C95.6692 162.509 105.169 180.509 119.669 187.009C139.169 197.009 163.169 194.009 186.016 182.025C201.703 173.796 205 159.456 227.853 159.456C244 159.456 260.696 152.172 270.016 140.31C288.32 117.014 272.5 77.5092 246.959 67.0643C231.876 60.8963 225.248 61.0092 220.846 45.7994C217 32.5092 215.5 22.9687 205.5 13.5093C187 -3.99075 160.211 1.51616 141.286 10.0321C128.817 15.6432 117.983 25.6265 103.482 19.0351C85.6688 12.5092 69.6688 11.0092 54.7605 16.5093C41.6688 22.0092 30.8794 38.1818 28.3628 51.5027Z"
              fill="#FFD200"
              stroke="black"
              strokeWidth="4"
              strokeLinecap="round"
            />
          </svg>
          <p>اعطي الهاتف لوالديك</p>
        </div>
        <div
          style={{
            display: "flex",
            alignItems: "center",
            flexDirection: "column",
          }}
        >
          <Long path="/welcome">انشاء حساب جديد</Long>
          <div className="another" style={{ margin: "20px 0 0 0" }}>
            <button onClick={() => navigate("/login")}>
              {" "}
              تــــســــــجـــيــــل الـــدخــــول
            </button>
            <span>لديك حساب ؟ </span>
          </div>
        </div>
      </div>
    </Wrapper>
  );
}

export default Parents;
